app/controllers/api/v1/challenges_controller.rb

SELECT "user_challenges".* FROM "user_challenges" WHERE "user_challenges"."challenge_id" = $1  [["challenge_id", 1]]
---
  def index
    @challenges = Challenge.all

SELECT "user_challenges".* FROM "user_challenges" WHERE "user_challenges"."challenge_id" = $1  [["challenge_id", 1]]
---
  def show
    @challenge = Challenge.find_by(id: params[:id])

INSERT INTO "challenges" ("name", "description", "challenge_type", "criteria", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["description", ""], ["challenge_type", ""], ["criteria", ""], ["created_at", "2017-12-03 22:27:29.140327"], ["updated_at", "2017-12-03 22:27:29.140327"]]
---
  def create
    @challenge = Challenge.create(challenge_params)