app/controllers/api/v1/user_challenges_controller.rb

SELECT "user_challenges".* FROM "user_challenges"
---
  def index
    @userChallenges = UserChallenge.all

INSERT INTO "user_challenges" ("user_id", "challenge_id", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["challenge_id", 57], ["role", "1"], ["created_at", "2017-12-04 01:34:47.579716"], ["updated_at", "2017-12-04 01:34:47.579716"]]
---
  def create
    @user_challenge = UserChallenge.create(user_challenge_params)