app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Rob"], ["password_digest", "$2a$10$oMVWDLwFnmURdus9dqH16.uyLB4Iz5V9YzvD9LWbCIZ9K9qjPCFkq"], ["created_at", "2017-12-04 15:16:51.891113"], ["updated_at", "2017-12-04 15:16:51.891113"]]
---
  def create
    @user = User.create(username: params[:username], password: params[:password])